constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet1
    {
        type            patch;
        nFaces          10;
        startFace       3505;
    }
    inlet2
    {
        type            patch;
        nFaces          10;
        startFace       3515;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       3525;
    }
    Wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3900;
        startFace       3535;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          160;
        startFace       7435;
    }
)

// ************************************************************************* //
