system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.000001;

vertices
(
    (0 0 0)
    (250 0 0)
    (250 -250 0)
    (350 -250 0)
    (350 0 0)
    (1600 0 0)
    (1600 100 0)
    (0 100 0)
    (0 0 100)
    (250 0 100)
    (250 -250 100)
    (350 -250 100)
    (350 0 100)
    (1600 0 100)
    (1600 100 100)
    (0 100 100)
    (250 100 0)
    (350 100 0)
    (250 100 100)
    (350 100 100)
);

blocks
(
    hex (0 1 16 7 8 9 18 15) (25 10 1) simpleGrading (1 1 1)
    hex (1 4 17 16 9 12 19 18) (10 10 1) simpleGrading (1 1 1)
    hex (4 5 6 17 12 13 14 19) (125 10 1) simpleGrading (1 1 1)
    hex (2 3 4 1 10 11 12 9) (10 25 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
     inlet1
    {
        type patch;
        faces
        (
            (0 8 15 7)
        );
    }
    inlet2
    {
        type patch;
        faces
        (
            (2 3 11 10)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (5 13 14 6)
        );
    }
    Wall
    {
        type wall;
        faces
        (
            (0 1 16 7 )
            (1 4 17 16)
            (4 5 6 17)
            (2 3 4 1)
            (8 9 18 15)
            (9 12 19 18)
            (12 13 14 19)
            (10 11 12 9)
            (0 1 9 8)
            (2 10 9 1)
            (3 11 12 4)
            (4 5 13 12)
        );
    }
   
);

mergePatchPairs
(
);

// ************************************************************************* //
